By.XPATH, ".//*[.='Личный Кабинет']" #Личный кабинет
By.XPATH, ".//*[.='Восстановить пароль']" #Восстановить пароль на странице авторизации
By.XPATH, ".//*[.='Имя']/input" #Инпут введения имени
By.XPATH, ".//*[.='Email']/input" #Инпут введения имейла
By.XPATH, ".//*[.='Пароль']/input" #Инпут введения пароля
By.XPATH, ".//*[.='Зарегистрироваться']" #кнопка Зарегистрироваться
By.XPATH, ".//*[.='Некорректный пароль']" #ошибка при неккоректном пароле
By.XPATH, ".//*[.='Войти в аккаунт']" #кнопка Войти в аккаунт
By.XPATH, ".//*[.='Войти']" #кнопка Войти на странице авторизации
By.XPATH, ".//*[.='Выход']" #кнопка Выход из личного кабинета
By.XPATH, ".//*[.='Восстановить']" #восстановление пароля
By.XPATH, ".//*[.='Восстановление пароля']" #восстановление пароля
By.XPATH, ".//*[contains (text(), 'Конструктор')]" #кнопка Конструктор
By.XPATH, ".//*[.='Соберите бургер']" #текст на главной
By.CLASS_NAME, "AppHeader_header__logo__2D0X2" #кнопка - логотит сайта
By.XPATH, "//li[@class='Account_listItem__35dAP']//button[text()='Выход']" #кнопка выхода из аккаунта
By.XPATH, ".//*[.='Соусы']" #раздел Соусы
By.XPATH, ".//*[.='Начинки']" #раздел Начинки
By.XPATH, ".//*[.='Булки']" #раздел Булки
By.XPATH, "//span[text()='Соусы']/ancestor::div[contains(@class, 'current')]" #локатор при клике на Соусы
By.XPATH, "//span[text()='Начинки']/ancestor::div[contains(@class, 'current')]" #локатор при клике на Начинки
By.XPATH, "//span[text()='Булки']/ancestor::div[contains(@class, 'current')]" #локатор при клике на Булки
